
&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//++shishkin@syspod.ru #89728
	Список.ТекстЗапроса = 
	 "ВЫБРАТЬ
	 |	ЗаказНаВнутреннееПотреблениеПереопределяемый.Ссылка КАК Ссылка,
	 |	ЗаказНаВнутреннееПотреблениеПереопределяемый.ПометкаУдаления КАК ПометкаУдаления,
	 |	ЗаказНаВнутреннееПотреблениеПереопределяемый.Номер КАК Номер,
	 |	ЗаказНаВнутреннееПотреблениеПереопределяемый.Дата КАК Дата,
	 |	ЗаказНаВнутреннееПотреблениеПереопределяемый.Проведен КАК Проведен,
	 |	ЗаказНаВнутреннееПотреблениеПереопределяемый.Комментарий КАК Комментарий,
	 |	ЗаказНаВнутреннееПотреблениеПереопределяемый.Организация КАК Организация,
	 |	ЗаказНаВнутреннееПотреблениеПереопределяемый.Ответственный КАК Ответственный,
	 |	ЗаказНаВнутреннееПотреблениеПереопределяемый.Подразделение КАК Подразделение,
	 |	ЗаказНаВнутреннееПотреблениеПереопределяемый.Склад КАК Склад,
	 |	ЗаказНаВнутреннееПотреблениеПереопределяемый.Статус КАК Статус,
	 |	ЗаказНаВнутреннееПотреблениеПереопределяемый.МаксимальныйКодСтроки КАК МаксимальныйКодСтроки,
	 |	ЗаказНаВнутреннееПотреблениеПереопределяемый.Сделка КАК Сделка,
	 |	ЗаказНаВнутреннееПотреблениеПереопределяемый.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	 |	ЗаказНаВнутреннееПотреблениеПереопределяемый.ДатаОтгрузки КАК ДатаОтгрузки,
	 |	ЗаказНаВнутреннееПотреблениеПереопределяемый.НеОтгружатьЧастями КАК НеОтгружатьЧастями,
	 |	ЗаказНаВнутреннееПотреблениеПереопределяемый.Назначение КАК Назначение,
	 |	ЗаказНаВнутреннееПотреблениеПереопределяемый.ДокументОснование КАК ДокументОснование,
	 |	ЗаказНаВнутреннееПотреблениеПереопределяемый.СостояниеЗаполненияМногооборотнойТары КАК СостояниеЗаполненияМногооборотнойТары,
	 |	ЗаказНаВнутреннееПотреблениеПереопределяемый.МоментВремени КАК МоментВремени,
	 |	ЗаказНаВнутреннееПотреблениеПереопределяемый.Товары.(
	 |		Ссылка КАК Ссылка,
	 |		НомерСтроки КАК НомерСтроки,
	 |		Номенклатура КАК Номенклатура,
	 |		Характеристика КАК Характеристика,
	 |		Упаковка КАК Упаковка,
	 |		КоличествоУпаковок КАК КоличествоУпаковок,
	 |		Количество КАК Количество,
	 |		ДатаОтгрузки КАК ДатаОтгрузки,
	 |		Отменено КАК Отменено,
	 |		КодСтроки КАК КодСтроки,
	 |		СтатьяРасходов КАК СтатьяРасходов,
	 |		АналитикаРасходов КАК АналитикаРасходов,
	 |		ФизическоеЛицо КАК ФизическоеЛицо,
	 |		СтатусУказанияСерий КАК СтатусУказанияСерий,
	 |		ВариантОбеспечения КАК ВариантОбеспечения,
	 |		Серия КАК Серия,
	 |		КатегорияЭксплуатации КАК КатегорияЭксплуатации,
	 |		ГруппаПродукции КАК ГруппаПродукции,
	 |		АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	 |		Обособленно КАК Обособленно
	 |	) КАК Товары,
	 |	ЗаказНаВнутреннееПотреблениеПереопределяемый.Автор КАК Автор,
	 |	ЗНАЧЕНИЕ(Перечисление.СостоянияВнутреннихЗаказов.ПустаяСсылка) КАК Состояние,
	 |	ЛОЖЬ КАК ЕстьРасхожденияОрдерНакладная,
	 |	ЗаказНаВнутреннееПотреблениеПереопределяемый.Приоритет КАК Приоритет,
	 |	ЕСТЬNULL(НаличиеФайлов.ЕстьФайлы, ЛОЖЬ) КАК ЕстьФайлы
	 |ИЗ
	 |	Документ.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотреблениеПереопределяемый
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
	 |		ПО ЗаказНаВнутреннееПотреблениеПереопределяемый.Ссылка = НаличиеФайлов.ОбъектСФайлами"; 
	
	НовыйЭлемент = Элементы.Вставить("ЕстьФайлы", Тип("ПолеФормы"), Элементы.Список, Элементы.ЕстьРасхожденияОрдерНакладная);
	НовыйЭлемент.ПутьКДанным = "Список.ЕстьФайлы";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеКартинки;
	НовыйЭлемент.КартинкаЗначений = БиблиотекаКартинок.Скрепка;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.КартинкаШапки = БиблиотекаКартинок.Скрепка; 
	//--shishkin@syspod.ru #89728
КонецПроцедуры
