&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	СписокЭтапов.Параметры.УстановитьЗначениеПараметра("ЭтапПроизводства",Объект.Ссылка);
КонецПроцедуры   


&НаСервере
Процедура СХК_ОтразитьКоличествоФактВТЧНаСервере(Исполнитель)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ОтразитьКоличествоФактВТЧ(Исполнитель);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	ЗаполнитьСлужебныеРеквизиты();
	ЗаполнитьСлужебныеРеквизитыТабличныхЧастей();
	
	НастроитьЗависимыеЭлементыФормы(ЭтотОбъект);
	
КонецПроцедуры


&НаКлиенте
Процедура СХК_ОтразитьКоличествоФактВТЧ(Исполнитель) Экспорт
	СХК_ОтразитьКоличествоФактВТЧНаСервере(Исполнитель); 
КонецПроцедуры

&НаСервере
Процедура Расш1_СХК_СвернутьПослеНаСервере()
	Если Объект.РасходМатериаловИРабот.Количество()>=1 Тогда
	   ВремТЗ =  Объект.РасходМатериаловИРабот.Выгрузить();
	   ВремТЗ.Свернуть("Подразделение,Номенклатура, Характеристика, Серия,Упаковка,СтатьяКалькуляции,ДатаРасхода,СтатусУказанияСерий","КоличествоУпаковок,Количество");
	   Объект.РасходМатериаловИРабот.Загрузить(ВремТЗ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Расш1_СХК_СвернутьПосле(Команда)
	Расш1_СХК_СвернутьПослеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура Расш1_СтатусПриИзмененииПослеНаСервере()
	Если Объект.Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Завершен Тогда
		
		Расш1_СХК_РасчитатьДолюСтоимостиНаСервере();
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
		|ГДЕ
		|	ПриходныйОрдерНаТовары.Проведен = &Проведен
		|	И ПриходныйОрдерНаТовары.ПометкаУдаления = &ПометкаУдаления
		|	И ПриходныйОрдерНаТовары.Распоряжение = &Распоряжение"; 
		Запрос.УстановитьПараметр("Проведен",Истина);
		Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
		Запрос.УстановитьПараметр("Распоряжение",Объект.Ссылка);
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			Док = Результат.Ссылка.ПолучитьОбъект(); 
			Док.Отправитель = Объект.Подразделение; 
			Док.НомерВходящегоДокумента = Док.Распоряжение.НомерНаПечать;
			ТабТовары = Док.Товары.Выгрузить();
			Док.Товары.Очистить();
			Док.Товары.Загрузить(ТабТовары);
			Док.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура Расш1_СХК_РасчитатьДолюСтоимостиНаСервере()
	ПроизводствоСервер.СХК_РассчитатьПроцентРаспределенияЗатратНаВыходныеИзделия(Объект, ПараметрыРаспределенияЗатрат,Неопределено);		
КонецПроцедуры

&НаКлиенте
Процедура Расш1_СтатусПриИзмененииПосле(Элемент)
	Расш1_СтатусПриИзмененииПослеНаСервере();
КонецПроцедуры

