
&НаСервере 
Функция ПолучитьСчет()
	//++shishkin@syspod.ru #89832
	Возврат __СпОбщийМодуль.ЗаполнитьБанковскийСчет(Контрагент);
	//--shishkin@syspod.ru #89832
КонецФункции 


&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//++shishkin@syspod.ru #89832
	ДобавляемыеРеквизиты = Новый Массив; //Определяем массив добавляемых реквизитов
	
	СчетИзКонтрагента = Новый РеквизитФормы("СчетИзКонтрагента",Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчетаОрганизаций")); 
	ДобавляемыеРеквизиты.Добавить(СчетИзКонтрагента);	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты); 
	ЭтаФорма.СчетИзКонтрагента = ПолучитьСчет();
	Если БанковскийСчетОрганизации <> ЭтаФорма.СчетИзКонтрагента Тогда
		БанковскийСчетОрганизации = ЭтаФорма.СчетИзКонтрагента;
	КонецЕсли;
	//--shishkin@syspod.ru #89832
КонецПроцедуры

&НаКлиенте
Процедура Расш1_БанковскийСчетОрганизацииПриИзмененииПосле(Элемент)
	//++shishkin@syspod.ru #89832
	Если БанковскийСчетОрганизации <> ЭтаФорма.СчетИзКонтрагента Тогда
		БанковскийСчетОрганизации = ЭтаФорма.СчетИзКонтрагента;
	КонецЕсли;
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Изменение счета организации доступно только в контрагенте!";
	Сообщение.Сообщить();
    //--shishkin@syspod.ru #89832
КонецПроцедуры
