
&Вместо("ОбъединитьВременныеТаблицы")
Процедура Расш1_ОбъединитьВременныеТаблицы(КонтейнерМенеджераВТ, ИменаИсточников, ИмяПриемника, ПоляТаблицы, РесурсыТаблицы, ПоляИндексирования, УдалятьИсточники)

	
	МассивИсточников = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИменаИсточников, ",",, Истина);
	
	КоличествоТаблицВЗапросе = 254;
	КоличествоЗапросов 		 = МассивИсточников.Количество() / КоличествоТаблицВЗапросе;
	КоличествоЗапросов 		 = Цел(КоличествоЗапросов) + ?(КоличествоЗапросов = Цел(КоличествоЗапросов), 0, 1);
	
	Если КоличествоЗапросов = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИмяВнутреннейТаблицы = "ВТВременноеХранилищеДляОбъединенияВТиВТ";
	ПриемникСуществует   = ВременнаяТаблицаСуществует(КонтейнерМенеджераВТ, ИмяПриемника);
	
	Если ЗначениеЗаполнено(ПоляТаблицы) И СтрНайти(ПоляТаблицы, "%") = 0 Тогда
		ПоляТаблицыСПрефиксом = СтрЗаменить(ПоляТаблицы, " ", "");
		ПоляТаблицыСПрефиксом = СтрЗаменить(ПоляТаблицыСПрефиксом, "	", "");
		ПоляТаблицыСПрефиксом = СтрЗаменить(ПоляТаблицыСПрефиксом, Символы.ПС, "");
		ПоляТаблицыСПрефиксом = "%1" + СтрЗаменить(ПоляТаблицыСПрефиксом, ",", ",%1");
	Иначе
		ПоляТаблицыСПрефиксом = ПоляТаблицы;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РесурсыТаблицы) И СтрНайти(РесурсыТаблицы, "%") = 0 Тогда
		РесурсыТаблицыСПрефиксом = СтрЗаменить(РесурсыТаблицы, " ", "");
		РесурсыТаблицыСПрефиксом = СтрЗаменить(РесурсыТаблицыСПрефиксом, "	", "");
		РесурсыТаблицыСПрефиксом = СтрЗаменить(РесурсыТаблицыСПрефиксом, Символы.ПС, "");
		РесурсыТаблицыСПрефиксом = "%1" + СтрЗаменить(РесурсыТаблицыСПрефиксом, ",", ",%1");
	Иначе
		РесурсыТаблицыСПрефиксом = РесурсыТаблицы;
	КонецЕсли;
	
	// Шаблоны
	ТекстПоляТаблицы = СокрЛП(СтрЗаменить(ПоляТаблицыСПрефиксом, "%1", "
		|	Т."));
	ТекстПоляИндексирования = ?(ПоляИндексирования = "", "", "ИНДЕКСИРОВАТЬ ПО " + ПоляИндексирования);
	
	ТекстСгруппированныеПоля   = "";
	ТекстОтборНепустыхРесурсов = "";
	ТекстГруппировкаПолей 	   = "";
	
	МассивПолей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
		СтрЗаменить(ПоляТаблицыСПрефиксом, "%1", "Т."),
		",",
		Истина,
		Истина);
	МассивРесурсов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
		СтрЗаменить(РесурсыТаблицыСПрефиксом, "%1", "Т."),
		",",
		Истина,
		Истина);
	
	Для Каждого ТекущееПоле Из МассивПолей Цикл
		
		Если МассивРесурсов.Найти(ТекущееПоле) <> Неопределено Тогда
			
			// Ресурс
			ТекстСгруппированныеПоля = ТекстСгруппированныеПоля 
				+ ?(ТекстСгруппированныеПоля = "", "", ",
				|	") + "СУММА(" + ТекущееПоле + ")";
				
			ТекстОтборНепустыхРесурсов = ТекстОтборНепустыхРесурсов 
				+ ?(ТекстОтборНепустыхРесурсов = "", "", "
				|	ИЛИ ") + "СУММА(" + ТекущееПоле + ") <> 0";
			
		Иначе
			
			// Измерение или реквизит
			ТекстСгруппированныеПоля = ТекстСгруппированныеПоля 
				+ ?(ТекстСгруппированныеПоля = "", "", ",
				|	") + ТекущееПоле;
			
			Если МассивРесурсов.Количество() > 0 Тогда
				ТекстГруппировкаПолей = ТекстГруппировкаПолей 
					+ ?(ТекстГруппировкаПолей = "", "", ",
					|	") + ТекущееПоле;
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЦикла;
	
	ТекстГруппировкаПолей =  
		?(ТекстГруппировкаПолей = "", "", "СГРУППИРОВАТЬ ПО
		|	") + ТекстГруппировкаПолей;
	ТекстОтборНепустыхРесурсов =  
		?(ТекстОтборНепустыхРесурсов = "", "", "ИМЕЮЩИЕ
		|	") + ТекстОтборНепустыхРесурсов;
	
	ШаблонЗапроса =
	"ВЫБРАТЬ
	|	&СгруппированныеПоля
	|ПОМЕСТИТЬ ИмяТаблицыПриемника
	|ИЗ
	|	ЗапросОбъединенияТаблиц КАК Т
	|ГДЕ &ГруппировкаПолей
	|
	|И &ОтборНепустыхРесурсов
	|
	|И &Индексы
	|";
	ШаблонЗапроса = СтрЗаменить(ШаблонЗапроса, "&СгруппированныеПоля", 	   ТекстСгруппированныеПоля);
	ШаблонЗапроса = СтрЗаменить(ШаблонЗапроса, "ГДЕ &ГруппировкаПолей",    ТекстГруппировкаПолей);
	ШаблонЗапроса = СтрЗаменить(ШаблонЗапроса, "И &ОтборНепустыхРесурсов", ТекстОтборНепустыхРесурсов);
	
	ШаблонВложенногоЗапроса =
	"ВЫБРАТЬ
	|	&Поля

	|ИЗ
	|	ИмяТаблицыИсточника КАК Т
	|";
	ШаблонВложенногоЗапроса = СтрЗаменить(ШаблонВложенногоЗапроса, "&Поля", ТекстПоляТаблицы);
	
	// Записи итоговой временной таблицы сворачиваются по всем измерениям и реквизитам регистра (всем полям, не являющимися ресурсами).
	// Записи со всеми пустыми ресурсами не помещаются в итоговую временную таблицу.
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ПолучитьМенеджерВТИзКонтейнера(КонтейнерМенеджераВТ);
	
	Для НомерЗапроса = 1 По КоличествоЗапросов Цикл
		
		ТекстЗапроса = "";
		ТекстУдаляемыеТаблицы = "";
		
		Если НомерЗапроса = 1 И ПриемникСуществует Тогда
			ИмяПромежуточнойТаблицы = ИмяПриемника;
		ИначеЕсли НомерЗапроса > 1 Тогда
			ИмяПромежуточнойТаблицы = ИмяВнутреннейТаблицы + Формат(НомерЗапроса - 1, "ЧГ=");
		Иначе
			ИмяПромежуточнойТаблицы = "";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИмяПромежуточнойТаблицы) Тогда
			ТекстЗапроса = СтрЗаменить(ШаблонВложенногоЗапроса, "ИмяТаблицыИсточника", ИмяПромежуточнойТаблицы);
			ТекстУдаляемыеТаблицы = ИмяПромежуточнойТаблицы;

		КонецЕсли;
		
		ИменаТаблицДляПротокола = "";
		
		Для НомерТаблицы = 1 По КоличествоТаблицВЗапросе Цикл
			
			Если МассивИсточников.Количество() = 0 Тогда
				Прервать;
			КонецЕсли;
			
			ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", "", "
				|ОБЪЕДИНИТЬ ВСЕ
				|") + СтрЗаменить(ШаблонВложенногоЗапроса, "ИмяТаблицыИсточника", МассивИсточников[0]);





			
			ИменаТаблицДляПротокола = ИменаТаблицДляПротокола + ?(ИменаТаблицДляПротокола = "", "", ",") + МассивИсточников[0];
			
			Если УдалятьИсточники Тогда
				ТекстУдаляемыеТаблицы = ТекстУдаляемыеТаблицы + ?(ТекстУдаляемыеТаблицы = "", "", ",") + МассивИсточников[0];
			КонецЕсли;
			
			МассивИсточников.Удалить(0);
			
		КонецЦикла;
		
		Если НомерЗапроса < КоличествоЗапросов ИЛИ ПриемникСуществует Тогда
			ИмяПромежуточнойТаблицы = ИмяВнутреннейТаблицы + Формат(НомерЗапроса, "ЧГ=");
		Иначе
			ИмяПромежуточнойТаблицы = ИмяПриемника;
		КонецЕсли;
		
		ТекстЗапроса = СтрЗаменить(ШаблонЗапроса, "ЗапросОбъединенияТаблиц", "(" + ТекстЗапроса + ")");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяТаблицыПриемника", ИмяПромежуточнойТаблицы);









		
		Если НомерЗапроса = КоличествоЗапросов И ИмяПромежуточнойТаблицы = ИмяПриемника Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &Индексы", ТекстПоляИндексирования);
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &Индексы", "");
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапроса;
		
		ВыполнитьЗапросСЗамеромДляПротокола(
			КонтейнерМенеджераВТ,
			Запрос,,
			ИменаТаблицДляПротокола,,
			НСтр("ru = 'Объединение временных таблиц';
				|en = 'Merge temporary tables'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
		УничтожитьВременныеТаблицы(КонтейнерМенеджераВТ, ТекстУдаляемыеТаблицы);
		ПриемникСуществует = Ложь;
		
		Если НомерЗапроса = КоличествоЗапросов И ИмяПромежуточнойТаблицы <> ИмяПриемника Тогда
			
			// Необходимо переложить данные из ИмяПромежуточнойТаблицы в ИмяПриемника
			Запрос.Текст =
			"ВЫБРАТЬ
			|	&Поля
			|ПОМЕСТИТЬ ИмяТаблицыПриемника
			|ИЗ
			|	ИмяТаблицыИсточника КАК Т
			|
			|ГДЕ &Индексы
			|";
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Поля", 		  		ТекстПоляТаблицы);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяТаблицыПриемника", ИмяПриемника);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяТаблицыИсточника", ИмяПромежуточнойТаблицы);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ &Индексы", 	    ТекстПоляИндексирования);
			
			ВыполнитьЗапросСЗамеромДляПротокола(
				КонтейнерМенеджераВТ,
				Запрос,,
				ИмяПромежуточнойТаблицы + "," + ИмяПриемника,,
				НСтр("ru = 'Объединение временных таблиц';
					|en = 'Merge temporary tables'", ОбщегоНазначения.КодОсновногоЯзыка()));
			
			УничтожитьВременныеТаблицы(Запрос, ИмяПромежуточнойТаблицы);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

